LoadUtils.checkForExistingBoundaryConditions(ADocument*,Pick!System.Runtime.CompilerServices.IsConst*,BoundaryConditionsType.Enum!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,GCurve!System.Runtime.CompilerServices.IsConst*,OwnerArr&lt;CurveLoop&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,ElementId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This method checks if boundary conditions of the specified type already exist at the given location.
pADoc: Currrent revit document where the Boundary Conditions exists.
pPick: Pick object specifying the target location
type: Type of boundary condition to check for
point: Point location to check
pGCurve: Curve to check against
oLoops: Curve loops to check within
boundaryConditionsId: ID of the boundary condition being checked
Returns: Returns the ElementId of existing boundary conditions if found, std::nullopt otherwise

LoadUtils.getEndPointFromPick(Pick!System.Runtime.CompilerServices.IsConst*,OwnerArr&lt;GCurve&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This method extracts the endpoint coordinate from a Pick object by searching through the provided curves.
pPick: Pick object containing the target location.
oGCurves: Array of curves to search for the endpoint
Returns: Returns the endpoint if found, std::nullopt otherwise

LoadUtils.getUniqueEndPointPicks(ADocument!System.Runtime.CompilerServices.IsConst*,Selection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns a unique array of end point picks.
Example: When the user selects two analytical members which are connected at an end point we want to have only one pick for that end point.
pADoc: Curent document
selection: User selection
Returns: Returns a unique array of picks.

LoadUtils.isCurveOverCurveLoopsFace(OwnerArr&lt;CurveLoop&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,Plane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,GCurve!System.Runtime.CompilerServices.IsConst*)
This method check if the input curve is over a given Face.
If the curve is over a front face edge, then is not considered over the face.
oLoops: Input Curve Loops
plane: Plane on which we want to check the curve
pCurve: Curve to be checked
Returns: Returns true if the curve is over the Face created from curve loops, false otherwise.

LoadUtils.pointsOutsideCurveLoops(OwnerArr&lt;CurveLoop&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,Arr&lt;XYZUtils.XYZ&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,Plane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This method checks if the input arr of points are outside of curve Loops.
oLoops: Input Curve Loops
points: Points to be checked
plane: Plane on which we want to check the points
Returns: Returns true if all points are outside of curve loop, false otherwise.

LoadUtils.pointsInsideCurveLoop(CurveLoop!System.Runtime.CompilerServices.IsConst*,Arr&lt;XYZUtils.XYZ&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,Plane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This method checks if the input arr of points are inside of curve Loops.
On boundary points are considered inside.
pLoop: Input Curve Loop
points: Points to be checked
plane: Plane on which we want to check the points
Returns: Returns true if all points are inside of curve loop, false otherwise.

LoadUtils.curveLiesOnCurve(GCurve!System.Runtime.CompilerServices.IsConst*,GCurve!System.Runtime.CompilerServices.IsConst*)
This method checks if the input curve lies in on a given curve.
pGCurve: Input curve
pCrvToBeChecked: Curve to be checked
Returns: Returns true if the curve lies on a given curve.

LoadUtils.isPointOnCurve(GCurve!System.Runtime.CompilerServices.IsConst*,XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This method checks if the point is on input curve.
pGCurve: Input curve
point: Point to be checked
Returns: Returns true if the point is on input curve, false otherwise